Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://nexolith-care-api.onrender.com"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Baseline Load Test (100 VUs / 1 min)"
    - duration: 60
      arrivalRate: 50
      rampto: 500
      name: "Stress Test Ramp (50 to 500 VUs)"
  defaults:
    headers:
      Content-Type: "application/json"
      User-Agent: "Artillery-Load-Test/1.0"

scenarios:
  - name: "Health Endpoint & Authentication Load Flow"
    flow:
      - get:
          url: "/api/health/"
          expect:
            - statusCode: 200
      - post:
          url: "/api/auth/login/"
          json:
            username: "artillery_user"
            password: "Password123!"
      - get:
          url: "/api/family/members/"
          expect:
            - statusCode: 401
